app/controllers/pictures_controller.rb

SELECT "pictures".* FROM "pictures" WHERE (created_at < '2018-07-07 00:00:00')
---
  def index
    @pictures = Picture.all

SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @picture = Picture.find(params[:id])

INSERT INTO "pictures" ("artist", "title", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["artist", "hello"], ["title", "jflksajdf"], ["url", "fdjflkajsdf"], ["created_at", 2018-08-16 18:10:38 UTC], ["updated_at", 2018-08-16 18:10:38 UTC]]
---
  def create
    @picture = Picture.new

    @picture.title = params[:picture][:title]
    @picture.artist = params[:picture][:artist]
    @picture.url = params[:picture][:url]


    if @picture.save

SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
      @picture = Picture.find(params[:id])

SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "pictures" SET "url" = ?, "updated_at" = ? WHERE "pictures"."id" = ?  [["url", "https://unsper/photos/y64hRtmtOpk"], ["updated_at", 2018-08-16 18:12:06 UTC], ["id", 1]]
---
    def update
      @picture = Picture.find(params[:id])

      @picture.title = params[:picture][:title]
      @picture.artist = params[:picture][:artist]
      @picture.url = params[:picture][:url]


      if @picture.save