app/controllers/users_controller.rb

INSERT INTO "users" ("password_digest", "created_at", "updated_at") VALUES (?, ?, ?)  [["password_digest", "$2a$10$hJ4sARnOJTyVRhluWPLk4OOVvS4MnaheNL1LleZ9iuZyIdVfCnCm6"], ["created_at", 2018-08-19 18:52:53 UTC], ["updated_at", 2018-08-19 18:52:53 UTC]]
---
  def create
    @user = User.new

    @user.password = params[:user][:password]
    @user.password_confirmation = params[:user][:password_confirmation]

    if @user.save